StoveSim/simulations/case_20/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.005008;

boundaryField
{
    primary_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
	secondary_air_RHS
    {
        type            fixedValue;
        value           uniform 0;
    }
	secondary_air_LHS
    {
        type            fixedValue;
        value           uniform 0;
    }	
	
    outlet_LHS
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
	outlet_RHS
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    stove_body
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
